# Pandas DataFrames

In [10]:
import numpy as np

In [11]:
import pandas as pd

In [12]:
from numpy.random import randn

In [13]:
np.random.seed(10)

In [14]:
df = pd.DataFrame(randn(3,3),['A','B','C'],['X','Y','Z'])

In [15]:
df

          X         Y         Z
A  1.331587  0.715279 -1.545400
B -0.008384  0.621336 -0.720086
C  0.265512  0.108549  0.004291

In [16]:
df['X']

A    1.331587
B   -0.008384
C    0.265512
Name: X, dtype: float64

In [17]:
type(df['X'])

pandas.core.series.Series

In [18]:
df[['Y','Z']]

          Y         Z
A  0.715279 -1.545400
B  0.621336 -0.720086
C  0.108549  0.004291

In [19]:
df.X

A    1.331587
B   -0.008384
C    0.265512
Name: X, dtype: float64

In [20]:
df["X"]

A    1.331587
B   -0.008384
C    0.265512
Name: X, dtype: float64

In [21]:
df["new"] = df["X"] + df["Y"]

In [22]:
df

          X         Y         Z       new
A  1.331587  0.715279 -1.545400  2.046865
B -0.008384  0.621336 -0.720086  0.612952
C  0.265512  0.108549  0.004291  0.374060

In [23]:
df.drop("new", axis=1, inplace=True)

In [24]:
df

          X         Y         Z
A  1.331587  0.715279 -1.545400
B -0.008384  0.621336 -0.720086
C  0.265512  0.108549  0.004291

In [25]:
df.drop("A")

          X         Y         Z
B -0.008384  0.621336 -0.720086
C  0.265512  0.108549  0.004291

In [26]:
df

          X         Y         Z
A  1.331587  0.715279 -1.545400
B -0.008384  0.621336 -0.720086
C  0.265512  0.108549  0.004291

In [27]:
df.loc["C"]

X    0.265512
Y    0.108549
Z    0.004291
Name: C, dtype: float64

In [28]:
df.iloc[1]

X   -0.008384
Y    0.621336
Z   -0.720086
Name: B, dtype: float64

In [29]:
df.loc["B","Y"]

0.6213359738904805

In [30]:
df.loc[["A","B"],["X","Y"]]

          X         Y
A  1.331587  0.715279
B -0.008384  0.621336

# DataFrames - Conditional Selection

In [2]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn

In [4]:
np.random.seed(10)

In [5]:
df = pd.DataFrame(randn(5,5),['A','B','C','D','E'],['V','W','X','Y','Z'])

In [6]:
df

          V         W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384  0.621336
B -0.720086  0.265512  0.108549  0.004291 -0.174600
C  0.433026  1.203037 -0.965066  1.028274  0.228630
D  0.445138 -1.136602  0.135137  1.484537 -1.079805
E -1.977728 -1.743372  0.266070  2.384967  1.123691

In [7]:
df > 0

       V      W      X      Y      Z
A   True   True  False  False   True
B  False   True   True   True  False
C   True   True  False   True   True
D   True  False   True   True  False
E  False  False   True   True   True

In [8]:
newdf = df>0

In [9]:
newdf

       V      W      X      Y      Z
A   True   True  False  False   True
B  False   True   True   True  False
C   True   True  False   True   True
D   True  False   True   True  False
E  False  False   True   True   True

In [10]:
df[newdf]

          V         W         X         Y         Z
A  1.331587  0.715279       NaN       NaN  0.621336
B       NaN  0.265512  0.108549  0.004291       NaN
C  0.433026  1.203037       NaN  1.028274  0.228630
D  0.445138       NaN  0.135137  1.484537       NaN
E       NaN       NaN  0.266070  2.384967  1.123691

In [11]:
df[df>0]

          V         W         X         Y         Z
A  1.331587  0.715279       NaN       NaN  0.621336
B       NaN  0.265512  0.108549  0.004291       NaN
C  0.433026  1.203037       NaN  1.028274  0.228630
D  0.445138       NaN  0.135137  1.484537       NaN
E       NaN       NaN  0.266070  2.384967  1.123691

In [12]:
df["W"]>0

A     True
B     True
C     True
D    False
E    False
Name: W, dtype: bool

In [42]:
df["W"]

A    0.715279
B    0.265512
C    1.203037
D   -1.136602
E   -1.743372
Name: W, dtype: float64

In [43]:
df[df["W"]>0]

          V         W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384  0.621336
B -0.720086  0.265512  0.108549  0.004291 -0.174600
C  0.433026  1.203037 -0.965066  1.028274  0.228630

In [44]:
df["X"]<0

A     True
B    False
C     True
D    False
E    False
Name: X, dtype: bool

In [45]:
df["X"]

A   -1.545400
B    0.108549
C   -0.965066
D    0.135137
E    0.266070
Name: X, dtype: float64

In [46]:
df[df["X"]<0]

          V         W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384  0.621336
C  0.433026  1.203037 -0.965066  1.028274  0.228630

In [47]:
newdf = df[df["X"]<0]

In [48]:
newdf

          V         W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384  0.621336
C  0.433026  1.203037 -0.965066  1.028274  0.228630

In [49]:
newdf["W"]

A    0.715279
C    1.203037
Name: W, dtype: float64

In [63]:
df[df["X"]<0][["W","Y"]]

          W         Y
A  0.715279 -0.008384
C  1.203037  1.028274

In [14]:
newseries = df["X"]<0
result = df[newseries]
result[["W","Y"]]

          W         Y
A  0.715279 -0.008384
C  1.203037  1.028274

In [22]:
df[(df["W"]>0) | (df["Y"]>1)]

          V         W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384  0.621336
B -0.720086  0.265512  0.108549  0.004291 -0.174600
C  0.433026  1.203037 -0.965066  1.028274  0.228630
D  0.445138 -1.136602  0.135137  1.484537 -1.079805
E -1.977728 -1.743372  0.266070  2.384967  1.123691

In [23]:
df

          V         W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384  0.621336
B -0.720086  0.265512  0.108549  0.004291 -0.174600
C  0.433026  1.203037 -0.965066  1.028274  0.228630
D  0.445138 -1.136602  0.135137  1.484537 -1.079805
E -1.977728 -1.743372  0.266070  2.384967  1.123691

In [27]:
df.reset_index()

  index         V         W         X         Y         Z
0     A  1.331587  0.715279 -1.545400 -0.008384  0.621336
1     B -0.720086  0.265512  0.108549  0.004291 -0.174600
2     C  0.433026  1.203037 -0.965066  1.028274  0.228630
3     D  0.445138 -1.136602  0.135137  1.484537 -1.079805
4     E -1.977728 -1.743372  0.266070  2.384967  1.123691

In [30]:
newind = "CA NY OR WY CO".split()

In [31]:
newind

['CA', 'NY', 'OR', 'WY', 'CO']

In [32]:
df["States"] = newind

In [33]:
df

          V         W         X         Y         Z States
A  1.331587  0.715279 -1.545400 -0.008384  0.621336     CA
B -0.720086  0.265512  0.108549  0.004291 -0.174600     NY
C  0.433026  1.203037 -0.965066  1.028274  0.228630     OR
D  0.445138 -1.136602  0.135137  1.484537 -1.079805     WY
E -1.977728 -1.743372  0.266070  2.384967  1.123691     CO

In [34]:
df.set_index("States")

               V         W         X         Y         Z
States
CA      1.331587  0.715279 -1.545400 -0.008384  0.621336
NY     -0.720086  0.265512  0.108549  0.004291 -0.174600
OR      0.433026  1.203037 -0.965066  1.028274  0.228630
WY      0.445138 -1.136602  0.135137  1.484537 -1.079805
CO     -1.977728 -1.743372  0.266070  2.384967  1.123691

# Missing Values

In [36]:
a = {"A":[1,2,np.nan],"B":[4,np.nan,np.nan],"C":[1,2,3]}

In [37]:
df = pd.DataFrame(a)

In [38]:
df

     A    B  C
0  1.0  4.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [42]:
df.dropna(thresh=2)

     A    B  C
0  1.0  4.0  1
1  2.0  NaN  2

In [43]:
df.fillna(value="FILL VALUE")

            A           B  C
0           1           4  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [45]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

A groupby allows you to group together rows based off a column and then perform some sort of aggregate function on them.

In [47]:
import numpy as np
import pandas as pd

In [48]:
data = {"Company":["Google","Google","Microsoft","Microsoft","Facebook","Facebook"],
       "Person": ["Sam","Charlie","Amy","Vanessa","Carl","Sarah"],
       "Sales":[200,120,340,124,243,350]}

In [49]:
df = pd.DataFrame(data)

In [50]:
df

     Company   Person  Sales
0     Google      Sam    200
1     Google  Charlie    120
2  Microsoft      Amy    340
3  Microsoft  Vanessa    124
4   Facebook     Carl    243
5   Facebook    Sarah    350

In [52]:
group = df.groupby("Company")

In [53]:
group

In [54]:
group.mean()

           Sales
Company
Facebook   296.5
Google     160.0
Microsoft  232.0

In [57]:
group.std().loc["Facebook"]

Sales    75.660426
Name: Facebook, dtype: float64

In [65]:
df.groupby("Company").describe().transpose()["Facebook"]

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: Facebook, dtype: float64